app/controllers/answers_controller.rb

  def index
    @questions = Question.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM "questions" LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "questions"

  def show
    @answer = current_user.answers.find(params[:id])
---
SELECT * FROM "answers" WHERE ("answers"."id" = 10 AND ("answers".user_id = 1))

  def new
    @questions = Question.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM "questions" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "questions"

  def edit
    @answer = Answer.find(params[:id])
---
SELECT * FROM "answers" WHERE ("answers"."id" = 1)

  def create

    @answers = params[:answer].values.collect do |answer|
      unless answer["id"].blank?
        answered = Answer.find_by_id(answer["id"])
---
SELECT * FROM "answers" WHERE ("answers"."id" = '') LIMIT 1

  def update
    @answer = Answer.find(params[:id])

    respond_to do |format|
      if @answer.update_attributes(params[:answer])
---
SELECT * FROM "answers" WHERE ("answers"."id" = 1)
UPDATE "answers" SET "answer" = 'a', "updated_at" = '2009-08-02 17:59:35' WHERE "id" = 1