app/controllers/answers_controller.rb

  def index
    @answers = current_user.answers.all
---
SELECT * FROM "answers" WHERE ("answers".user_id = 1)