app/controllers/questions_controller.rb

SELECT * FROM "questions"
---
  def index
    @questions = Question.all

SELECT * FROM "questions" WHERE ("questions"."id" = 1)
---
  def show
    @question = Question.find(params[:id])

SELECT * FROM "questions" WHERE ("questions"."id" = 3)
---
  def edit
    @question = Question.find(params[:id])

INSERT INTO "questions" ("updated_at", "question", "position", "created_at") VALUES('2009-07-25 05:38:00', 'will this work?', NULL, '2009-07-25 05:38:00')
---
  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save

SELECT * FROM "questions" WHERE ("questions"."id" = 1)
UPDATE "questions" SET "question" = 'question 1', "updated_at" = '2009-07-30 14:44:35' WHERE "id" = 1
---
  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])

SELECT * FROM "questions" WHERE ("questions"."id" = 7)
DELETE FROM "questions" WHERE "id" = 7
---
  def destroy
    @question = Question.find(params[:id])
    @question.destroy