app/controllers/users_controller.rb

INSERT INTO "users" ("last_login_at", "last_request_at", "dna", "updated_at", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "email", "last_login_ip", "created_at") VALUES(NULL, '2009-08-03 07:36:01', NULL, '2009-08-03 07:36:01', 'e39771d1d981cf47e4ef64af24738453f5f12b95102d8c24b8fa3d5c84064dd413e285827c577b52500fa652d34e70b625c40fb7e7cc6137a863f32ae883c1c7', 'OD9Ba2J8mBdi7FwbaxlE', 'ezoPFj2DV_or4BrRwzKc', '127.0.0.1', 'VfzTT6KdXs8kIrOjBuyT', '2009-08-03 07:36:01', 0, '3afaed76dc156bebc485e8ecc7d4db813ec80e2f4a9e8e1c10a33a32a7d018d6b55ed1fa95e0003eb1a8359bf770bd87bcb6b25d65a35bc3e4a822e31b29f258', 1, 'vinhboy@gmail.com', NULL, '2009-08-03 07:36:01')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "perishable_token" = 'aqcpJ7pPK8y0xjTPPn-L', "last_request_at" = '2009-07-26 07:01:46', "updated_at" = '2009-07-26 07:01:46' WHERE "id" = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])